[
  {
    "id": 1,
    "word": "Context",
    "definition": "A way to pass data through the component tree without having to pass props down manually at every level."
  },
  {
    "id": 2,
    "word": "Provider",
    "definition": "A component that provides data to its children via the context API."
  },
  {
    "id": 3,
    "word": "Consumer",
    "definition": "A component that consumes data from a provider component via the context API."
  },
  {
    "id": 4,
    "word": "useContext",
    "definition": "A hook that allows functional components to consume data from a provider component via the context API."
  },
  {
    "id": 5,
    "word": "Redux",
    "definition": "A predictable state container for JavaScript apps."
  },
  {
    "id": 6,
    "word": "Store",
    "definition": "A single source of truth for the state of the entire application."
  },
  {
    "id": 7,
    "word": "Action",
    "definition": "A plain JavaScript object that describes a change in the state of the application."
  },
  {
    "id": 8,
    "word": "Reducer",
    "definition": "A pure function that takes the current state and an action, and returns the new state."
  },
  {
    "id": 9,
    "word": "Dispatch",
    "definition": "A function that sends an action to the store to update the state of the application."
  },
  {
    "id": 10,
    "word": "Connect",
    "definition": "A higher-order function that connects a React component to the Redux store."
  },
  {
    "id": 11,
    "word": "Selector",
    "definition": "A function that extracts a specific piece of data from the state of the application."
  },
  {
    "id": 12,
    "word": "Middleware",
    "definition": "A function that intercepts actions before they reach the reducer, allowing for side effects such as logging or asynchronous API calls."
  },
  {
    "id": 13,
    "word": "Immutable",
    "definition": "Not capable of being changed."
  },
  {
    "id": 14,
    "word": "Immutability",
    "definition": "The concept of not changing data directly, but instead creating a new copy of the data with the desired changes."
  },
  {
    "id": 15,
    "word": "Action Creator",
    "definition": "A function that creates an action object."
  },
  {
    "id": 16,
    "word": "Thunk",
    "definition": "A function that delays the evaluation of an expression."
  },
  {
    "id": 17,
    "word": "Saga",
    "definition": "A middleware for Redux that handles side effects such as asynchronous API calls."
  },
  {
    "id": 18,
    "word": "DevTools",
    "definition": "A browser extension that provides a visual interface for debugging Redux applications."
  },
  {
    "id": 19,
    "word": "React-Redux",
    "definition": "A library that provides bindings between React and Redux."
  },
  {
    "id": 20,
    "word": "Redux Toolkit",
    "definition": "A library that provides utilities and abstractions to simplify common Redux use cases."
  }
]
