[
  {
    "id": 1,
    "word": "asynchronous",
    "definition": "A programming model that allows the program to execute tasks concurrently, without waiting for the completion of other tasks."
  },
  {
    "id": 2,
    "word": "callback",
    "definition": "A function that is passed as an argument to another function and is executed after some operation has been completed."
  },
  {
    "id": 3,
    "word": "closure",
    "definition": "A function that has access to variables in its outer (enclosing) scope, even after the outer function has returned."
  },
  {
    "id": 4,
    "word": "debugging",
    "definition": "The process of finding and fixing errors or bugs in a program."
  },
  {
    "id": 5,
    "word": "event loop",
    "definition": "The secret behind Node.js's non-blocking I/O. Technically, Node.js is a single-threaded event loop. It is a loop that listens for events, and then triggers a callback function when one of those events is detected."
  },
  {
    "id": 6,
    "word": "middleware",
    "definition": "A function that sits between two layers of software and acts as a bridge between them. In the context of Node.js, middleware is often used to add functionality to an HTTP server."
  },
  {
    "id": 7,
    "word": "module",
    "definition": "A self-contained unit of code that can be reused across multiple projects. In Node.js, modules are typically implemented as separate files."
  },
  {
    "id": 8,
    "word": "npm",
    "definition": "A package manager for Node.js that allows developers to easily install and manage third-party packages and dependencies."
  },
  {
    "id": 9,
    "word": "package.json",
    "definition": "A file that contains metadata about a Node.js project, including its name, version, and dependencies."
  },
  {
    "id": 10,
    "word": "promise",
    "definition": "An object that represents a value that may not be available yet, but will be resolved at some point in the future. Promises are often used in asynchronous programming to handle the results of asynchronous operations."
  },
  {
    "id": 11,
    "word": "require",
    "definition": "A function in Node.js that is used to load modules. When called with a module name, it returns the exports object of that module."
  },
  {
    "id": 12,
    "word": "REST",
    "definition": "An architectural style for building web services that uses HTTP methods (GET, POST, PUT, DELETE) to perform CRUD (Create, Read, Update, Delete) operations on resources."
  },
  {
    "id": 13,
    "word": "stream",
    "definition": "A sequence of data that is processed in chunks, rather than all at once. Streams are often used in Node.js to handle large amounts of data, such as files or network connections."
  },
  {
    "id": 14,
    "word": "template engine",
    "definition": "A tool that allows developers to generate HTML (or other markup) dynamically, using templates and data. In Node.js, popular template engines include Handlebars and EJS."
  },
  {
    "id": 15,
    "word": "testing",
    "definition": "The process of verifying that a program works as intended, by running automated tests that check its behavior under different conditions."
  },
  {
    "id": 16,
    "word": "thread",
    "definition": "A sequence of instructions that can be executed independently of other sequences. In Node.js, threads are often used to handle CPU-intensive tasks, such as image processing or encryption."
  },
  {
    "id": 17,
    "word": "TypeScript",
    "definition": "A superset of JavaScript that adds optional static typing and other features to the language. TypeScript is often used in large-scale Node.js projects to improve code quality and maintainability."
  },
  {
    "id": 18,
    "word": "unit testing",
    "definition": "A type of testing that focuses on individual units or components of a program, rather than the program as a whole. Unit tests are often automated and run as part of a continuous integration (CI) process."
  },
  {
    "id": 19,
    "word": "version control",
    "definition": "The process of tracking changes to a set of files over time, in order to facilitate collaboration and prevent data loss. In the context of Node.js, popular version control systems include Git and SVN."
  },
  {
    "id": 20,
    "word": "yarn",
    "definition": "A package manager for Node.js that is designed to be faster and more reliable than npm. Yarn uses a deterministic algorithm to ensure that dependencies are installed in a consistent and reproducible way."
  }
]
