[
  {
    "id": 1,
    "word": "Component",
    "definition": "A reusable piece of UI that can be composed with other components to form a more complex UI."
  },
  {
    "id": 2,
    "word": "JSX",
    "definition": "A syntax extension for JavaScript that allows you to write HTML-like code in your JavaScript files."
  },
  {
    "id": 3,
    "word": "Virtual DOM",
    "definition": "A lightweight representation of the actual DOM that React keeps in memory and uses to calculate the most efficient way to update the actual DOM."
  },
  {
    "id": 4,
    "word": "Props",
    "definition": "Short for properties, props are a way to pass data from a parent component to a child component."
  },
  {
    "id": 5,
    "word": "State",
    "definition": "An object that represents the parts of a component that can change over time."
  },
  {
    "id": 6,
    "word": "Lifecycle methods",
    "definition": "Special methods that get called at specific points in a component's life, such as when it is first mounted or when it is about to be unmounted."
  },
  {
    "id": 7,
    "word": "Event handling",
    "definition": "The process of responding to user actions, such as clicks or key presses, in a web application."
  },
  {
    "id": 8,
    "word": "Conditional rendering",
    "definition": "The process of rendering different content based on certain conditions, such as whether a user is logged in or not."
  },
  {
    "id": 9,
    "word": "Hooks",
    "definition": "A feature introduced in React 16.8 that allows you to use state and other React features in functional components."
  },
  {
    "id": 10,
    "word": "Context",
    "definition": "A way to pass data down through a component tree without having to pass props manually at every level."
  },
  {
    "id": 11,
    "word": "Refs",
    "definition": "A way to access the underlying DOM nodes or React components of a rendered component."
  },
  {
    "id": 12,
    "word": "Higher-order components",
    "definition": "A pattern in React where a component takes another component as an argument and returns a new component with additional functionality."
  },
  {
    "id": 13,
    "word": "Render props",
    "definition": "A pattern in React where a component takes a function as a prop and calls that function with some data, allowing the function to render the data in any way it wants."
  },
  {
    "id": 14,
    "word": "Server-side rendering",
    "definition": "The process of rendering a React application on the server and sending the resulting HTML to the client, which can improve performance and SEO."
  },
  {
    "id": 15,
    "word": "Redux",
    "definition": "A popular state management library for React applications."
  },
  {
    "id": 16,
    "word": "React Router",
    "definition": "A popular library for handling client-side routing in React applications."
  },
  {
    "id": 17,
    "word": "React Native",
    "definition": "A framework for building native mobile applications using React."
  },
  {
    "id": 18,
    "word": "Next.js",
    "definition": "A framework for building server-rendered React applications."
  },
  {
    "id": 19,
    "word": "Gatsby",
    "definition": "A framework for building static websites using React and GraphQL."
  },
  {
    "id": 20,
    "word": "GraphQL",
    "definition": "A query language for APIs that allows you to specify exactly what data you need and get it in a single request."
  }
]
