[
  {
    "id": 1,
    "word": "fetch",
    "definition": "A web API used to fetch data from a server, without the need for a full page refresh."
  },
  {
    "id": 2,
    "word": "promise",
    "definition": "An object representing the eventual completion or failure of an asynchronous operation."
  },
  {
    "id": 3,
    "word": "async/await",
    "definition": "A syntax for writing asynchronous code that looks like synchronous code."
  },
  {
    "id": 4,
    "word": "response",
    "definition": "An object representing the response to a fetch request."
  },
  {
    "id": 5,
    "word": "JSON",
    "definition": "A lightweight data interchange format that is easy for humans to read and write and easy for machines to parse and generate."
  },
  {
    "id": 6,
    "word": "XMLHttpRequest",
    "definition": "An API that provides client functionality for transferring data between a client and a server."
  },
  {
    "id": 7,
    "word": "REST",
    "definition": "A software architectural style that defines a set of constraints to be used for creating web services."
  },
  {
    "id": 8,
    "word": "API",
    "definition": "A set of protocols, routines, and tools for building software and applications."
  },
  {
    "id": 9,
    "word": "endpoint",
    "definition": "A URL that is the entry point for a web service."
  },
  {
    "id": 10,
    "word": "status code",
    "definition": "A code that indicates the status of a HTTP response."
  },
  {
    "id": 11,
    "word": "header",
    "definition": "Information that is transmitted along with the HTTP request or response."
  },
  {
    "id": 12,
    "word": "CORS",
    "definition": "A mechanism that allows many resources (e.g., fonts, JavaScript, etc.) on a web page to be requested from another domain outside the domain from which the resource originated."
  },
  {
    "id": 13,
    "word": "authentication",
    "definition": "The process of verifying the identity of a user or process."
  },
  {
    "id": 14,
    "word": "authorization",
    "definition": "The process of determining whether a user or process has the necessary permissions to access a resource."
  },
  {
    "id": 15,
    "word": "query string",
    "definition": "A part of a URL that contains data to be passed to web applications."
  },
  {
    "id": 16,
    "word": "payload",
    "definition": "The data that is sent to a server in a HTTP request."
  },
  {
    "id": 17,
    "word": "method",
    "definition": "The HTTP method used to make a request to a server."
  },
  {
    "id": 18,
    "word": "cookie",
    "definition": "A small piece of data stored on the client-side that is sent to the server with every request."
  },
  {
    "id": 19,
    "word": "session",
    "definition": "A period of time during which a client interacts with a server."
  },
  {
    "id": 20,
    "word": "cache",
    "definition": "A mechanism for storing data in memory or on disk so that it can be retrieved more quickly."
  }
]
