[
  {
    "id": 1,
    "word": "Cache",
    "definition": "A component that transparently stores data so that future requests for that data can be served faster."
  },
  {
    "id": 2,
    "word": "Cache Hit",
    "definition": "When a requested item is found in the cache."
  },
  {
    "id": 3,
    "word": "Cache Miss",
    "definition": "When a requested item is not found in the cache."
  },
  {
    "id": 4,
    "word": "Cache Eviction",
    "definition": "The process of removing an item from the cache to make room for a new item."
  },
  {
    "id": 5,
    "word": "Cache Invalidation",
    "definition": "The process of removing an item from the cache because it is no longer valid."
  },
  {
    "id": 6,
    "word": "Cache Coherency",
    "definition": "The property that ensures that all copies of a cached item are kept up-to-date with each other."
  },
  {
    "id": 7,
    "word": "Cache Hierarchy",
    "definition": "A system of multiple caches, where each cache is responsible for storing a subset of the data stored in the caches below it."
  },
  {
    "id": 8,
    "word": "Cache Line",
    "definition": "The smallest unit of data that can be stored in a cache."
  },
  {
    "id": 9,
    "word": "Cache Cores",
    "definition": "The number of processing cores that share a cache."
  },
  {
    "id": 10,
    "word": "Cache Partitioning",
    "definition": "The process of dividing a cache into multiple partitions, each of which is dedicated to a specific task or set of tasks."
  },
  {
    "id": 11,
    "word": "Cache Thrashing",
    "definition": "The phenomenon where a cache is constantly being filled and emptied, resulting in poor performance."
  },
  {
    "id": 12,
    "word": "Cache Write Policy",
    "definition": "The policy that determines when data is written back to main memory from the cache."
  },
  {
    "id": 13,
    "word": "Cache Read Policy",
    "definition": "The policy that determines when data is read from main memory into the cache."
  },
  {
    "id": 14,
    "word": "Cache Write-Through",
    "definition": "A write policy where data is written to both the cache and main memory at the same time."
  },
  {
    "id": 15,
    "word": "Cache Write-Back",
    "definition": "A write policy where data is written only to the cache, and is written back to main memory only when the cache line is evicted."
  },
  {
    "id": 16,
    "word": "Cache Associativity",
    "definition": "The degree to which a cache location can be used to store data from any location in main memory."
  },
  {
    "id": 17,
    "word": "Cache Direct-Mapped",
    "definition": "A cache where each location in main memory can be mapped to only one location in the cache."
  },
  {
    "id": 18,
    "word": "Cache Set-Associative",
    "definition": "A cache where each location in main memory can be mapped to a set of locations in the cache."
  },
  {
    "id": 19,
    "word": "Cache Fully-Associative",
    "definition": "A cache where each location in main memory can be mapped to any location in the cache."
  },
  {
    "id": 20,
    "word": "Cache Replacement Policy",
    "definition": "The policy that determines which cache line is evicted when a new line is brought into the cache."
  }
]
